# TilePatterns Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TilePatterns Class
Members See Also
---
The TilePatterns object is an interface for retrieving the TilePattern objects within the Document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class TilePatterns : APIObject
```

Visual Basic
---
```text
Public Class TilePatterns _
	Inherits APIObject
```

Visual C++
---
```text
public ref class TilePatterns : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..TilePatterns
# See Also
TilePatterns Members
Autodesk.Revit.DB Namespace